## 데이터 프레임 복습

In [209]:
# 데이터 프레임 생성 
import pandas as pd

In [210]:
df = pd.DataFrame({'a' : [1, 2, 3], 'b' : [4, 5, 6], 'c' : [7, 8, 9]})
type(df)

pandas.core.frame.DataFrame

In [211]:
df

   a  b  c
0  1  4  7
1  2  5  8
2  3  6  9

In [212]:
a = [[1, 4, 7], [2, 5, 8], [3, 6, 9]]
a

[[1, 4, 7], [2, 5, 8], [3, 6, 9]]

In [213]:
df2 = pd.DataFrame(a)
df2

   0  1  2
0  1  4  7
1  2  5  8
2  3  6  9

In [214]:
df2.columns = ['a', 'b', 'c']
df2

   a  b  c
0  1  4  7
1  2  5  8
2  3  6  9

In [215]:
df3 = pd.DataFrame({'company' : ['abc', '회사', '123'], '직원수' : [400, 10, 6]})
df3

  company  직원수
0     abc  400
1      회사   10
2     123    6

In [216]:
import numpy as np
df3['위치'] = ['Seoul', np.nan, 'Busan']
df3

  company  직원수     위치
0     abc  400  Seoul
1      회사   10    NaN
2     123    6  Busan

In [217]:
df = pd.DataFrame({'a' : [1, 2, 3], 'b' : [4, 5, 6], 'c' : [7, 8, 9]})
df

   a  b  c
0  1  4  7
1  2  5  8
2  3  6  9

In [218]:
df.columns

Index(['a', 'b', 'c'], dtype='object')

In [219]:
df.columns[1]

'b'

In [220]:
df.columns = ['d', 'e', 'f']
df

   d  e  f
0  1  4  7
1  2  5  8
2  3  6  9

In [221]:
df.columns = ['디', 'e', '에프']
df

   디  e  에프
0  1  4   7
1  2  5   8
2  3  6   9

In [222]:
df = pd.DataFrame({'a' : [1, 2, 3], 'b' : [4, 5, 6], 'c' : [7, 8, 9]})
df

   a  b  c
0  1  4  7
1  2  5  8
2  3  6  9

In [223]:
df.rename(columns ={'a' : '디', 'c' : '에프'}, inplace = True)
df

   디  b  에프
0  1  4   7
1  2  5   8
2  3  6   9

In [224]:
df = pd.DataFrame({'a' : [1, 2, 3], 'b' : [4, 5, 6], 'c' : [7, 8, 9]})

In [225]:
df

   a  b  c
0  1  4  7
1  2  5  8
2  3  6  9

In [226]:
df.rename(columns = {'a' : '에이'}, inplace = True)

In [227]:
df

   에이  b  c
0   1  4  7
1   2  5  8
2   3  6  9

In [228]:
import copy

In [229]:
df = pd.DataFrame({'a' : [1, 2, 3], 'b' : [4, 5, 6], 'c' : [7, 8, 9]})
df2 = copy.deepcopy(df)
df2

   a  b  c
0  1  4  7
1  2  5  8
2  3  6  9

In [230]:
df2.columns = ['d', 'e', 'f']

In [231]:
df, df2

(   a  b  c
 0  1  4  7
 1  2  5  8
 2  3  6  9,
    d  e  f
 0  1  4  7
 1  2  5  8
 2  3  6  9)

In [232]:
df = pd.DataFrame({'a' : [1, 2, 3], 'b' : [4, 5, 6], 'c' : [7, 8, 9]})

In [233]:
df['a']

0    1
1    2
2    3
Name: a, dtype: int64

In [234]:
type(df['a'])

pandas.core.series.Series

In [235]:
a = pd.Series([1, 2, 3, 1, 2, 3])
a

0    1
1    2
2    3
3    1
4    2
5    3
dtype: int64

In [236]:
a = pd.Series([1, 2, 3, 1, 2, 3], index = ['a', 'b', 'c', 'd', 'e', 'f'])
a

a    1
b    2
c    3
d    1
e    2
f    3
dtype: int64

In [237]:
a['e']

2

In [238]:
df

   a  b  c
0  1  4  7
1  2  5  8
2  3  6  9

In [239]:
a = df['a']
a

0    1
1    2
2    3
Name: a, dtype: int64

In [240]:
a.unique()

array([1, 2, 3], dtype=int64)

In [241]:
df[['a', 'b']]

   a  b
0  1  4
1  2  5
2  3  6

In [242]:
# loc, iloc   
df = pd.DataFrame({'a' : [i for i in range(1, 11)], 'b' : [i for i in range(11, 21)], 'c' : [i for i in range(21, 31)]})
df

    a   b   c
0   1  11  21
1   2  12  22
2   3  13  23
3   4  14  24
4   5  15  25
5   6  16  26
6   7  17  27
7   8  18  28
8   9  19  29
9  10  20  30

In [243]:
df[['a', 'b']]

    a   b
0   1  11
1   2  12
2   3  13
3   4  14
4   5  15
5   6  16
6   7  17
7   8  18
8   9  19
9  10  20

In [244]:
df.loc[0]

a     1
b    11
c    21
Name: 0, dtype: int64

In [245]:
df.loc[2 : 4]

   a   b   c
2  3  13  23
3  4  14  24
4  5  15  25

In [246]:
index = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'g', 'h', 'i']
df.index = index
df

    a   b   c
a   1  11  21
b   2  12  22
c   3  13  23
d   4  14  24
e   5  15  25
f   6  16  26
g   7  17  27
g   8  18  28
h   9  19  29
i  10  20  30

In [247]:
df.loc['g']

   a   b   c
g  7  17  27
g  8  18  28

In [248]:
df.loc['c' : ]

    a   b   c
c   3  13  23
d   4  14  24
e   5  15  25
f   6  16  26
g   7  17  27
g   8  18  28
h   9  19  29
i  10  20  30

In [249]:
df.loc[['g', 'i'], ['a', 'c']]

    a   c
g   7  27
g   8  28
i  10  30

In [250]:
df = pd.DataFrame({'a' : [i for i in range(1, 11)], 'b' : [i for i in range(11, 21)], 'c' : [i for i in range(21, 31)]})
df.iloc[ : 5, [0, 2]]

   a   c
0  1  21
1  2  22
2  3  23
3  4  24
4  5  25

In [251]:
index = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'g', 'h', 'i']
df.index = index
df

    a   b   c
a   1  11  21
b   2  12  22
c   3  13  23
d   4  14  24
e   5  15  25
f   6  16  26
g   7  17  27
g   8  18  28
h   9  19  29
i  10  20  30

In [252]:
df.iloc[ : 5, [0, 2]]

   a   c
a  1  21
b  2  22
c  3  23
d  4  24
e  5  25

In [253]:
df = pd.DataFrame({'a' : [i for i in range(1, 11)], 'b' : [i for i in range(11, 21)], 'c' : [i for i in range(21, 31)]})
df

    a   b   c
0   1  11  21
1   2  12  22
2   3  13  23
3   4  14  24
4   5  15  25
5   6  16  26
6   7  17  27
7   8  18  28
8   9  19  29
9  10  20  30

In [254]:
df.loc[ : , ['a', 'c']]

    a   c
0   1  21
1   2  22
2   3  23
3   4  24
4   5  25
5   6  26
6   7  27
7   8  28
8   9  29
9  10  30

In [255]:
df.loc[df['a'] >= 3]

    a   b   c
2   3  13  23
3   4  14  24
4   5  15  25
5   6  16  26
6   7  17  27
7   8  18  28
8   9  19  29
9  10  20  30

In [256]:
df.loc[df['a'] >= 3, ['a', 'c']]

    a   c
2   3  23
3   4  24
4   5  25
5   6  26
6   7  27
7   8  28
8   9  29
9  10  30

In [257]:
df.loc[(df['a'] >= 3) & (df['b'] < 16)]

   a   b   c
2  3  13  23
3  4  14  24
4  5  15  25

In [258]:
df.loc[(df['a'] <= 3) | (df['a'] >= 7)]

    a   b   c
0   1  11  21
1   2  12  22
2   3  13  23
6   7  17  27
7   8  18  28
8   9  19  29
9  10  20  30

In [259]:
df.loc[(df['a'] >= 3) & ((df['b'] < 16) | (df['c'] == 30))]

    a   b   c
2   3  13  23
3   4  14  24
4   5  15  25
9  10  20  30

In [260]:
df = pd.DataFrame({'a' : [2, 3, 2, 7, 4], 'b' : [2, 1, 3, 5, 3], 'c' : [1, 1, 2, 3, 5]})
df

   a  b  c
0  2  2  1
1  3  1  1
2  2  3  2
3  7  5  3
4  4  3  5

In [261]:
df.sort_index(ascending = False, inplace = True)

In [262]:
df.reset_index(drop=True, inplace = True)

In [263]:
df

   a  b  c
0  4  3  5
1  7  5  3
2  2  3  2
3  3  1  1
4  2  2  1

In [264]:
df = pd.DataFrame({'a' : [2, 3, 2, 7, 4], 'b' : [2, 1, 3, 5, 3], 'c' : [1, 1, 2, 3, 5]})

In [265]:
df.sort_values(by = ['a'], inplace = True)

In [266]:
df

   a  b  c
0  2  2  1
2  2  3  2
1  3  1  1
4  4  3  5
3  7  5  3

In [267]:
df.sort_values(by = ['a'], ascending = False, inplace = True)
df

   a  b  c
3  7  5  3
4  4  3  5
1  3  1  1
0  2  2  1
2  2  3  2

In [268]:
df.sort_values(by = ['a', 'b'])

   a  b  c
0  2  2  1
2  2  3  2
1  3  1  1
4  4  3  5
3  7  5  3

In [269]:
df.sort_values(by=['a', 'b'], ascending=[True, False], inplace = True)

In [270]:
df.reset_index(drop = True, inplace = True)

In [271]:
df

   a  b  c
0  2  3  2
1  2  2  1
2  3  1  1
3  4  3  5
4  7  5  3

In [272]:
df = pd.DataFrame({'a' : [1, 1, 3, 4, 5], 'b' : [2, 3, np.nan, 3, 4], 'c' : [3, 4, 7, 6, 4]})
df

   a    b  c
0  1  2.0  3
1  1  3.0  4
2  3  NaN  7
3  4  3.0  6
4  5  4.0  4

In [273]:
df.isnull()

       a      b      c
0  False  False  False
1  False  False  False
2  False   True  False
3  False  False  False
4  False  False  False

In [274]:
df.isnull().sum()

a    0
b    1
c    0
dtype: int64

In [275]:
df.dropna()

   a    b  c
0  1  2.0  3
1  1  3.0  4
3  4  3.0  6
4  5  4.0  4

In [276]:
df.dropna(inplace = True)

In [277]:
df = pd.DataFrame({'a' : [1, 1, 3, 4, 5], 'b' : [2, 3, np.nan, 3, 4], 'c' : [3, 4, 7, 6, 4]})

In [278]:
df.dropna(axis = 1)

   a  c
0  1  3
1  1  4
2  3  7
3  4  6
4  5  4

In [279]:
df

   a    b  c
0  1  2.0  3
1  1  3.0  4
2  3  NaN  7
3  4  3.0  6
4  5  4.0  4

In [280]:
df.fillna(0, inplace = True)
df

   a    b  c
0  1  2.0  3
1  1  3.0  4
2  3  0.0  7
3  4  3.0  6
4  5  4.0  4

In [281]:
df = pd.DataFrame({'a' : [1, 1, 3, 4, np.nan], 'b' : [2, 3, np.nan, np.nan, 4], 'c' : [np.nan, 4, 7, 6, 4]})
df

     a    b    c
0  1.0  2.0  NaN
1  1.0  3.0  4.0
2  3.0  NaN  7.0
3  4.0  NaN  6.0
4  NaN  4.0  4.0

In [282]:
df.fillna(method = 'bfill')

     a    b    c
0  1.0  2.0  4.0
1  1.0  3.0  4.0
2  3.0  4.0  7.0
3  4.0  4.0  6.0
4  NaN  4.0  4.0

In [283]:
df.fillna(method = 'ffill')

     a    b    c
0  1.0  2.0  NaN
1  1.0  3.0  4.0
2  3.0  3.0  7.0
3  4.0  3.0  6.0
4  4.0  4.0  4.0

In [284]:
df.fillna(method = 'ffill', limit = 1)

     a    b    c
0  1.0  2.0  NaN
1  1.0  3.0  4.0
2  3.0  3.0  7.0
3  4.0  NaN  6.0
4  4.0  4.0  4.0

In [285]:
df

     a    b    c
0  1.0  2.0  NaN
1  1.0  3.0  4.0
2  3.0  NaN  7.0
3  4.0  NaN  6.0
4  NaN  4.0  4.0

In [286]:
df.fillna(df.mean())

      a    b     c
0  1.00  2.0  5.25
1  1.00  3.0  4.00
2  3.00  3.0  7.00
3  4.00  3.0  6.00
4  2.25  4.0  4.00

In [287]:
df = pd.DataFrame({'판매일' : ['5/11/21', '5/12/21', '5/13/21', '5/14/21', '5/15/21'],
                    '판매량' : ['10', '15', '20', '25', '30'],
                    '방문자수' : ['10', '-', '17', '23', '25'],
                    '기온' : ['24.1', '24.3', '24.8', '25', '25.4']})
df

       판매일 판매량 방문자수    기온
0  5/11/21  10   10  24.1
1  5/12/21  15    -  24.3
2  5/13/21  20   17  24.8
3  5/14/21  25   23    25
4  5/15/21  30   25  25.4

In [288]:
df.dtypes

판매일     object
판매량     object
방문자수    object
기온      object
dtype: object

In [289]:
df = df.astype({'판매량' : 'int'})

In [290]:
df['방문자수'] = pd.to_numeric(df['방문자수'], errors='coerce')

In [291]:
df

       판매일  판매량  방문자수    기온
0  5/11/21   10  10.0  24.1
1  5/12/21   15   NaN  24.3
2  5/13/21   20  17.0  24.8
3  5/14/21   25  23.0    25
4  5/15/21   30  25.0  25.4

In [292]:
df.fillna(0, inplace=True)
df = df.astype({'방문자수' : 'int'})

In [293]:
df

       판매일  판매량  방문자수    기온
0  5/11/21   10    10  24.1
1  5/12/21   15     0  24.3
2  5/13/21   20    17  24.8
3  5/14/21   25    23    25
4  5/15/21   30    25  25.4

In [294]:
df['판매일'] = pd.to_datetime(df['판매일'], format = '%m/%d/%y')
df

         판매일  판매량  방문자수    기온
0 2021-05-11   10    10  24.1
1 2021-05-12   15     0  24.3
2 2021-05-13   20    17  24.8
3 2021-05-14   25    23    25
4 2021-05-15   30    25  25.4

In [295]:
df.dtypes

판매일     datetime64[ns]
판매량              int32
방문자수             int32
기온              object
dtype: object

In [296]:
df = pd.DataFrame({'a' : [1, 1, 3, 4, 5], 'b' : [2, 3, 2, 3, 4], 'c' : [3, 4, 7, 6, 4]})
df

   a  b  c
0  1  2  3
1  1  3  4
2  3  2  7
3  4  3  6
4  5  4  4

In [297]:
df['d'] = [1, 3, 6, 4, 8]
df

   a  b  c  d
0  1  2  3  1
1  1  3  4  3
2  3  2  7  6
3  4  3  6  4
4  5  4  4  8

In [298]:
df['e'] = 1

In [299]:
df

   a  b  c  d  e
0  1  2  3  1  1
1  1  3  4  3  1
2  3  2  7  6  1
3  4  3  6  4  1
4  5  4  4  8  1

In [300]:
df.drop(['d', 'e'], axis = 1, inplace = True)

In [301]:
df

   a  b  c
0  1  2  3
1  1  3  4
2  3  2  7
3  4  3  6
4  5  4  4

In [302]:
df = df.append({'a' : 6, 'b' : 7, 'c' : 8}, ignore_index = True)

C:\Users\94dng\AppData\Local\Temp\ipykernel_3456\2980971988.py:1: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df = df.append({'a' : 6, 'b' : 7, 'c' : 8}, ignore_index = True)

In [303]:
df

   a  b  c
0  1  2  3
1  1  3  4
2  3  2  7
3  4  3  6
4  5  4  4
5  6  7  8

In [304]:
df.loc[6] = [7, 8, 9]

In [305]:
df

   a  b  c
0  1  2  3
1  1  3  4
2  3  2  7
3  4  3  6
4  5  4  4
5  6  7  8
6  7  8  9

In [306]:
df = df.drop([0, 1])
df

   a  b  c
2  3  2  7
3  4  3  6
4  5  4  4
5  6  7  8
6  7  8  9

In [307]:
df = pd.DataFrame({'a' : [1, 1, 3, 4, 5], 'b' : [2, 3, 2, 3, 4], 'c' : [3, 4, 7, 6, 4]})

In [308]:
df.drop([i for i in range(4)])

   a  b  c
4  5  4  4

In [309]:
df.drop(df.index[ : 4])

   a  b  c
4  5  4  4

In [310]:
df.drop(df[df['a'] < 4].index)

   a  b  c
3  4  3  6
4  5  4  4

In [311]:
df.drop(df[(df['a'] < 3) & (df['c'] == 4)].index)

   a  b  c
0  1  2  3
2  3  2  7
3  4  3  6
4  5  4  4

In [312]:
df = pd.DataFrame({'a' : [1, 2, 3, 4, 5]})

In [313]:
df['b'] = 0

In [314]:
def case_function(x):
    if x < 2:
        return '2 미만'
    elif x < 4:
        return '4 미만'
    else:
        return '4 이상'
df['b'] = df['a'].apply(case_function)
df

   a     b
0  1  2 미만
1  2  4 미만
2  3  4 미만
3  4  4 이상
4  5  4 이상

## 실시간 강의

In [315]:
import pandas as pd   
import numpy as np  
import matplotlib.pyplot as plt  
import seaborn as sns

In [316]:
file = './titanic/train.csv'
titanic = pd.read_csv(file)
titanic

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [317]:
titanic.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [318]:
titanic.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

In [319]:
# 결측치가 있는 데이터 출력
# any() 해당 조건이 하나라도 있는가?
# all() 해당 조건이 모두 해당되는가?
titanic[titanic.isnull().any(axis = 1)]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
5,6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q
7,8,0,3,"Palsson, Master. Gosta Leonard",male,2.0,3,1,349909,21.0750,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
884,885,0,3,"Sutehall, Mr. Henry Jr",male,25.0,0,0,SOTON/OQ 392076,7.0500,NaN,S
885,886,0,3,"Rice, Mrs. William (Margaret Norton)",female,39.0,0,5,382652,29.1250,NaN,Q
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [320]:
# 1. Cabin column을 버리고
# 2. 비어 있는 모든 row를 버린다. 
titanic = titanic.drop(['Cabin'], axis = 1)
titanic

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,S
...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,Q

In [321]:
titanic

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,S
...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,Q

In [322]:
titanic.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 11 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(4)
memory usage: 76.7+ KB

In [323]:
titanic[titanic.isnull().any(axis = 1)]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Embarked
5,6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,Q
17,18,1,2,"Williams, Mr. Charles Eugene",male,NaN,0,0,244373,13.0000,S
19,20,1,3,"Masselmani, Mrs. Fatima",female,NaN,0,0,2649,7.2250,C
26,27,0,3,"Emir, Mr. Farred Chehab",male,NaN,0,0,2631,7.2250,C
28,29,1,3,"O'Dwyer, Miss. Ellen ""Nellie""",female,NaN,0,0,330959,7.8792,Q
...,...,...,...,...,...,...,...,...,...,...,...
859,860,0,3,"Razi, Mr. Raihed",male,NaN,0,0,2629,7.2292,C
863,864,0,3,"Sage, Miss. Dorothy Edith ""Dolly""",female,NaN,8,2,CA. 2343,69.5500,S
868,869,0,3,"van Melkebeke, Mr. Philemon",male,NaN,0,0,345777,9.5000,S
878,879,0,3,"Laleff, Mr. Kristo",male,NaN,0,0,349217,7.8958,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,S

In [324]:
titanic = titanic.dropna()
titanic

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,S
...,...,...,...,...,...,...,...,...,...,...,...
885,886,0,3,"Rice, Mrs. William (Margaret Norton)",female,39.0,0,5,382652,29.1250,Q
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,Q

In [334]:
pivot = pd.pivot_table(data = titanic, index = 'Sex', values = 'Survived', aggfunc = ['mean', 'sum', 'count'])
pivot

            mean      sum    count
        Survived Survived Survived
Sex
female  0.752896      195      259
male    0.205298       93      453

In [335]:
pivot = pd.pivot_table(data = titanic, index = ['Sex', 'Pclass'], values = 'Survived', aggfunc = ['count', 'sum', 'mean'])
pivot

                 count      sum      mean
              Survived Survived  Survived
Sex    Pclass
female 1            83       80  0.963855
       2            74       68  0.918919
       3           102       47  0.460784
male   1           101       40  0.396040
       2            99       15  0.151515
       3           253       38  0.150198

In [336]:
pd.pivot_table(data = titanic, index = ['Sex', 'Pclass'], values = 'Embarked', aggfunc = lambda x : x.mode().values[0])

              Embarked
Sex    Pclass
female 1             S
       2             S
       3             S
male   1             S
       2             S
       3             S